stubs/libxml2/samples/190f0eb83077c3db5873704ee8a1593ae8777333

<l:log xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11101" message="1"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsa:To>http://soapinterop.java.sun.com:8080/jaxwsa-w3c_wsdl/ExplicitAction</wsa:To><wsa:ReplyTo><wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address></wsa:ReplyTo><wsa:MessageID>urn:uuid:ED9757F9B44F90C3EF1154272151361119</wsa:MessageID><wsa:Action>http://example.org/action/echoIn</wsa:Action></soapenv:Header><soapenv:Body><echo:echoIn xmlns:echo="http://example.org/echo">fault-test11101</echo:echoIn></soapenv:Body></soapenv:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11101" message="2"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoFault</Action><RelatesTo xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:ED9757F9B44F90C3EF1154272151361119</RelatesTo></S:Header><S:Body><ns2:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/"><faultcode>ns2:Server</faultcode><faultstring>"fault-test11101" triggered the fault</faultstring><detail><ns4:echoFault xmlns:ns4="http://example.org/echo" xmlns:ns5="http://example.org/notify">"fault-test11101" triggered the fault</ns4:echoFault></detail></ns2:Fault></S:Body></S:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11060" message="1"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header /><soapenv:Body><echo:echoIn xmlns:echo="http://example.org/echo">test11060</echo:echoIn></soapenv:Body></soapenv:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11060" message="2"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/wsaTestService2/wsaTestPortType/echoResponse</Action></S:Header><S:Body><ns2:echoOut xmlns:ns2="http://example.org/echo" xmlns="http://example.org/notify">test11060</ns2:echoOut></S:Body></S:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11050" message="1"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsa:To>http://soapinterop.java.sun.com:8080/jaxwsa-w3c_wsdl/AddressingNotRequired</wsa:To><wsa:ReplyTo><wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address></wsa:ReplyTo><wsa:MessageID>urn:uuid:ED9757F9B44F90C3EF1154272162629125</wsa:MessageID><wsa:Action>http://example.org/wsaTestService2/wsaTestPortType/echoRequest</wsa:Action></soapenv:Header><soapenv:Body><echo:echoIn xmlns:echo="http://example.org/echo">test11050</echo:echoIn></soapenv:Body></soapenv:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11050" message="2"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://www.w3.org/2005/08/addressing/anonymous</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/wsaTestService2/wsaTestPortType/echoResponse</Action><RelatesTo xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:ED9757F9B44F90C3EF1154272162629125</RelatesTo></S:Header><S:Body><ns2:echoOut xmlns:ns2="http://example.org/echo" xmlns="http://example.org/notify">test11050</ns2:echoOut></S:Body></S:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11040" message="1"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header /><soapenv:Body><echo:echoIn xmlns:echo="http://example.org/echo">test11040</echo:echoIn></soapenv:Body></soapenv:Envelope></l:content></l:message><l:message xmlns:l="http://www.w3.org/2002/ws/addressing/logs/" testcase="test11040" message="2"><l:content xmlns:l="http://www.w3.org/2002/ws/addressing/logs/"><S:Envelope 